app/controllers/alerts_controller.rb

  def index
    @alert = Alert.all.last
---
SELECT "alerts".* FROM "alerts"

  def create
    alert = Alert.new(params[:alert])

    if alert.save
---
INSERT INTO "alerts" ("created_at", "description", "river_level", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 28 Nov 2012 01:18:50 UTC +00:00], ["description", "Prueba desde el formulario Web"], ["river_level", 1.0], ["updated_at", Wed, 28 Nov 2012 01:18:50 UTC +00:00]]

  def show
    @alert = Alert.find(params[:id])
---
SELECT "alerts".* FROM "alerts" WHERE "alerts"."id" = ? LIMIT 1  [["id", "13"]]