app/controllers/config_controller.rb

SELECT "apps".* FROM "apps"
---
  def index
    @app = App.all.last

SELECT "apps".* FROM "apps"
UPDATE "apps" SET "email" = 'dsales@uninorte.edu.co', "updated_at" = '2012-12-01 21:04:56.259433' WHERE "apps"."id" = 1
INSERT INTO "apps" ("created_at", "email", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 01 Dec 2012 20:48:51 UTC +00:00], ["email", "danilogarcia024@gmail.com"], ["updated_at", Sat, 01 Dec 2012 20:48:51 UTC +00:00]]
---
  def create
    a = App.all
    if a[0]
      a = a[0]
      if a.update_attribute(:email, params[:app][:email])
        flash[:notice] = "Email Configurado Satisfactoriamente"
        respond_to do |format|
          format.html {redirect_to config_path a}
          format.json { render json: a}
        end
      else
        respond_to do |format|
          format.html {render 'new'}
          format.json { render json: a}
        end
      end
    else
      a = App.new(params[:app])
      if a.save

SELECT "apps".* FROM "apps" WHERE "apps"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @app = App.find(params[:id])