app/controllers/root_controller.rb

  def index
  	@alerts = Alert.order("id desc").all
---
SELECT "alerts".* FROM "alerts" ORDER BY id desc